app/controllers/v1/products_controller.rb

INSERT INTO "products" ("name", "description", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    product = Product.new(product_params)

    if product.save