app/controllers/v1/products_controller.rb

SELECT "products".* FROM "products" INNER JOIN "types" ON "types"."product_id" = "products"."id"
---
  def index
    products = Product.joins(:types)