app/controllers/v1/types_controller.rb

SELECT "types".* FROM "types"
---
  def index
    types = Type.all